{
  "word2id": {
    "[PAD]": 0,
    "[UNK]": 1,
    "[SEP]": 2,
    "[START]": 3,
    "[END]": 4,
    "<project_start>": 5,
    "<project_end>": 6,
    "<scene_start>": 7,
    "<scene_end>": 8,
    "<object_start>": 9,
    "<object_end>": 10,
    "<script_start>": 11,
    "<script_end>": 12,
    "<global_var>": 13,
    "<global_list>": 14,
    "<broadcast>": 15,
    "<signal>": 16,
    "PlaceAtBrick": 17,
    "HideBrick": 18,
    "WaitBrick": 19,
    "SetSizeToBrick": 20,
    "RepeatBrick": 21,
    "SetVariableBrick": 22,
    "IfThenLogicBeginBrick": 23,
    "ForeverBrick": 24,
    "ShowBrick": 25,
    "BroadcastBrick": 26,
    "SetLookBrick": 27,
    "PointInDirectionBrick": 28,
    "SceneStartBrick": 29,
    "SetTransparencyBrick": 30,
    "PlaySoundBrick": 31,
    "RepeatUntilBrick": 32,
    "ShowTextColorSizeAlignmentBrick": 33,
    "SetBrightnessBrick": 34,
    "ChangeVariableBrick": 35,
    "IfLogicBeginBrick": 36,
    "UserDefinedBrick": 37,
    "GlideToBrick": 38,
    "HideTextBrick": 39,
    "NextLookBrick": 40,
    "WriteBaseBrick": 41,
    "ReadVariableFromDeviceBrick": 42,
    "SetPhysicsObjectTypeBrick": 43,
    "AskBrick": 44,
    "WriteVariableOnDeviceBrick": 45,
    "SetLookByIndexBrick": 46,
    "ChangeXByNBrick": 47,
    "Set3dPositionBrick": 48,
    "ReadBaseBrick": 49,
    "WaitUntilBrick": 50,
    "SetPhysicsStateBrick": 51,
    "CloneBrick": 52,
    "Set3dScaleBrick": 53,
    "SceneTransitionBrick": 54,
    "SetBackgroundBrick": 55,
    "ChangeYByNBrick": 56,
    "DeleteThisCloneBrick": 57,
    "SetBounceBrick": 58,
    "ComeToFrontBrick": 59,
    "GoToBrick": 60,
    "SetRotationStyleBrick": 61,
    "GoNStepsBackBrick": 62,
    "NoteBrick": 63,
    "StopSoundBrick": 64,
    "ShowToastBlock": 65,
    "StopScriptBrick": 66,
    "SetFrictionBrick": 67,
    "SetWidthBrick": 68,
    "PlaySoundAndWaitBrick": 69,
    "ChangeSizeByNBrick": 70,
    "ChangeTransparencyByNBrick": 71,
    "Create3dObjectBrick": 72,
    "SetYBrick": 73,
    "BigAskBrick": 74,
    "SetGravityBrick": 75,
    "SetObjectColorBrick": 76,
    "Set3dFrictionBrick": 77,
    "SayForBubbleBrick": 78,
    "ShowTextBrick": 79,
    "BroadcastWaitBrick": 80,
    "AddItemToUserListBrick": 81,
    "OpenUrlBrick": 82,
    "SetXBrick": 83,
    "ShowTextFontBrick": 84,
    "SetSkyColorBrick": 85,
    "ShowText3Brick": 86,
    "ExitStageBrick": 87,
    "SetVolumeToBrick": 88,
    "MoveNStepsBrick": 89,
    "HideText3Brick": 90,
    "ChangeWidthBrick": 91,
    "TurnLeftBrick": 92,
    "SetHeightBrick": 93,
    "StopAllSoundsBrick": 94,
    "SetVelocityBrick": 95,
    "Set3dVelocityBrick": 96,
    "Set3dRotationBrick": 97,
    "ClearGraphicEffectBrick": 98,
    "WriteVariableToFileBrick": 99,
    "CreateSphereBrick": 100,
    "ReadVariableFromFileBrick": 101,
    "CastRayBrick": 102,
    "DeleteWebBrick": 103,
    "SetFogBrick": 104,
    "VibrationBrick": 105,
    "PointToBrick": 106,
    "SetBackgroundByIndexBrick": 107,
    "ChangeBrightnessByNBrick": 108,
    "TurnRightBrick": 109,
    "CreateWebUrlBrick": 110,
    "SetDirectionalLightBrick": 111,
    "Set3dGravityBrick": 112,
    "SetRestitutionBrick": 113,
    "CreateVideoBrick": 114,
    "PreviousLookBrick": 115,
    "CreateWebFileBrick": 116,
    "LookRequestBrick": 117,
    "ChangeHeightBrick": 118,
    "SetCameraFocusPointBrick": 119,
    "Remove3dObjectBrick": 120,
    "CreateTextFieldBrick": 121,
    "ReadListFromDeviceBrick": 122,
    "SetSoundVolumeBrick": 123,
    "SetPenColorBrick": 124,
    "WebRequestBrick": 125,
    "ChooseFileBrick": 126,
    "SplitBrick": 127,
    "FadeParticleEffectBrick": 128,
    "ForVariableFromToBrick": 129,
    "ChooseCameraBrick": 130,
    "SayBubbleBrick": 131,
    "SetMassBrick": 132,
    "CameraBrick": 133,
    "ReadFromFilesBrick": 134,
    "SetAmbientLightBrick": 135,
    "ClearUserListBrick": 136,
    "FlashBrick": 137,
    "DeleteItemOfUserListBrick": 138,
    "SetParticleColorBrick": 139,
    "SetColorBrick": 140,
    "ReplaceItemInUserListBrick": 141,
    "EvalWebBrick": 142,
    "CameraLookAtBrick": 143,
    "StoreCSVIntoUserListBrick": 144,
    "ObjectLookAtBrick": 145,
    "CopyTextBrick": 146,
    "WriteToFilesBrick": 147,
    "SetThirdPersonCameraBrick": 148,
    "WriteListOnDeviceBrick": 149,
    "SetCameraPosition2Brick": 150,
    "SetCCDBrick": 151,
    "CreateTableBrick": 152,
    "CreateDialogBrick": 153,
    "ShowDialogBrick": 154,
    "SpeakBrick": 155,
    "SetPositiveBrick": 156,
    "DeleteFilesBrick": 157,
    "EnablePbrRenderBrick": 158,
    "MoveFilesBrick": 159,
    "AsyncRepeatBrick": 160,
    "StringToTableBrick": 161,
    "PlayDrumForBeatsBrick": 162,
    "IfOnEdgeBounceBrick": 163,
    "TurnLeftSpeedBrick": 164,
    "SetCameraPositionBrick": 165,
    "LoadFromInternalStorageBrick": 166,
    "ChangeColorByNBrick": 167,
    "PaintNewLookBrick": 168,
    "PlaySoundAtBrick": 169,
    "ApplyImpulseBrick": 170,
    "PlayAnimationBrick": 171,
    "SetWebBrick": 172,
    "ParticleEffectAdditivityBrick": 173,
    "AddRadioBrick": 174,
    "SetPenSizeBrick": 175,
    "TurnRightSpeedBrick": 176,
    "PinToCameraBrick": 177,
    "SetCallbackBrick": 178,
    "ThinkForBubbleBrick": 179,
    "PenUpBrick": 180,
    "LaunchProjectBrick": 181,
    "RunJSBrick": 182,
    "SetCameraZoomBrick": 183,
    "OrientationBrick": 184,
    "PenDownBrick": 185,
    "LoadSceneAdditiveBrick": 186,
    "SetHitboxBrick": 187,
    "SetCameraRangeBrick": 188,
    "SetNegativeBrick": 189,
    "PauseVideoBrick": 190,
    "AskSpeechBrick": 191,
    "CreateVarBrick": 192,
    "SoundFilesBrick": 193,
    "RunLuaBrick": 194,
    "AskGPTBrick": 195,
    "ResetTimerBrick": 196,
    "ExportProjectFileBrick": 197,
    "SaveToInternalStorageBrick": 198,
    "LoadSceneBrick": 199,
    "AskGemini2Brick": 200,
    "AskGeminiBrick": 201,
    "SetShaderCodeBrick": 202,
    "SetInstrumentBrick": 203,
    "SetLookFilesBrick": 204,
    "DeleteAllTablesBrick": 205,
    "ClearBackgroundBrick": 206,
    "SetCameraRotation2Brick": 207,
    "PlayVideoBrick": 208,
    "SetGeminiKeyBrick": 209,
    "PostWebRequestBrick": 210,
    "IntervalRepeatBrick": 211,
    "RunPythonScriptBrick": 212,
    "KeyEventBrick": 213,
    "LookFromTableBrick": 214,
    "SpeakAndWaitBrick": 215,
    "SetViewPositionBrick": 216,
    "CutLookBrick": 217,
    "SetBackgroundAndWaitBrick": 218,
    "ChangeVolumeByNBrick": 219,
    "RunVMBrick": 220,
    "PlayNoteForBeatsBrick": 221,
    "SetSkyboxBrick": 222,
    "AddEditBrick": 223,
    "BackgroundRequestBrick": 224,
    "ToggleDisplayBrick": 225,
    "TapForBrick": 226,
    "InsertTableBrick": 227,
    "CreateParticlesBrick": 228,
    "DividePolandBrick": 229,
    "StartRecordingBrick": 230,
    "StopRecordingBrick": 231,
    "DeleteBaseBrick": 232,
    "SendServerBrick": 233,
    "StampBrick": 234,
    "StopRunningStitchBrick": 235,
    "PutFloatBrick": 236,
    "HideStatusBarBrick": 237,
    "LunoScriptBrick": 238,
    "ConnectServerBrick": 239,
    "ThreedCreateCylinderBrick": 240,
    "ThreedAttachObjectToBoneBrick": 241,
    "SetMaterialBrick": 242,
    "SetParentBrick": 243,
    "PrepareMusicAs3DSoundBrick": 244,
    "PlaySoundAtPositionBrick": 245,
    "OpenFileBrick": 246,
    "SetTempoBrick": 247,
    "DeleteLookBrick": 248,
    "InsertItemIntoUserListBrick": 249,
    "MouseEventBrick": 250,
    "UnpinFromCameraBrick": 251,
    "DeleteVarBrick": 252,
    "SeekVideoBrick": 253,
    "LegoNxtMotorStopBrick": 254,
    "PrepareSoundBrick2": 255,
    "StitchBrick": 256,
    "SetThreadColorBrick": 257,
    "RunningStitchBrick": 258,
    "TripleStitchBrick": 259,
    "SewUpBrick": 260,
    "WriteEmbroideryToFileBrick": 261,
    "CreateFloatBrick": 262,
    "TableToFloatBrick": 263,
    "LoadNNBrick": 264,
    "ListenMicroBrick": 265,
    "LoadNativeModuleBrick": 266,
    "CreateDistanceJointBrick": 267,
    "EditLookBrick": 268,
    "SetBackgroundLightBrick": 269,
    "SetFreeCameraBrick": 270,
    "SetRotationLockBrick": 271,
    "ZigZagStitchBrick": 272,
    "CreateDiskBrick": 273,
    "StopVMBrick": 274,
    "StartServerBrick": 275,
    "ZipBrick": 276,
    "ResizeImgBrick": 277,
    "StartListeningBrick": 278,
    "PerformRayCastBrick": 279,
    "FileUrlBrick": 280,
    "SoundFileBrick": 281
  },
  "id2word": {
    "0": "[PAD]",
    "1": "[UNK]",
    "2": "[SEP]",
    "3": "[START]",
    "4": "[END]",
    "5": "<project_start>",
    "6": "<project_end>",
    "7": "<scene_start>",
    "8": "<scene_end>",
    "9": "<object_start>",
    "10": "<object_end>",
    "11": "<script_start>",
    "12": "<script_end>",
    "13": "<global_var>",
    "14": "<global_list>",
    "15": "<broadcast>",
    "16": "<signal>",
    "17": "PlaceAtBrick",
    "18": "HideBrick",
    "19": "WaitBrick",
    "20": "SetSizeToBrick",
    "21": "RepeatBrick",
    "22": "SetVariableBrick",
    "23": "IfThenLogicBeginBrick",
    "24": "ForeverBrick",
    "25": "ShowBrick",
    "26": "BroadcastBrick",
    "27": "SetLookBrick",
    "28": "PointInDirectionBrick",
    "29": "SceneStartBrick",
    "30": "SetTransparencyBrick",
    "31": "PlaySoundBrick",
    "32": "RepeatUntilBrick",
    "33": "ShowTextColorSizeAlignmentBrick",
    "34": "SetBrightnessBrick",
    "35": "ChangeVariableBrick",
    "36": "IfLogicBeginBrick",
    "37": "UserDefinedBrick",
    "38": "GlideToBrick",
    "39": "HideTextBrick",
    "40": "NextLookBrick",
    "41": "WriteBaseBrick",
    "42": "ReadVariableFromDeviceBrick",
    "43": "SetPhysicsObjectTypeBrick",
    "44": "AskBrick",
    "45": "WriteVariableOnDeviceBrick",
    "46": "SetLookByIndexBrick",
    "47": "ChangeXByNBrick",
    "48": "Set3dPositionBrick",
    "49": "ReadBaseBrick",
    "50": "WaitUntilBrick",
    "51": "SetPhysicsStateBrick",
    "52": "CloneBrick",
    "53": "Set3dScaleBrick",
    "54": "SceneTransitionBrick",
    "55": "SetBackgroundBrick",
    "56": "ChangeYByNBrick",
    "57": "DeleteThisCloneBrick",
    "58": "SetBounceBrick",
    "59": "ComeToFrontBrick",
    "60": "GoToBrick",
    "61": "SetRotationStyleBrick",
    "62": "GoNStepsBackBrick",
    "63": "NoteBrick",
    "64": "StopSoundBrick",
    "65": "ShowToastBlock",
    "66": "StopScriptBrick",
    "67": "SetFrictionBrick",
    "68": "SetWidthBrick",
    "69": "PlaySoundAndWaitBrick",
    "70": "ChangeSizeByNBrick",
    "71": "ChangeTransparencyByNBrick",
    "72": "Create3dObjectBrick",
    "73": "SetYBrick",
    "74": "BigAskBrick",
    "75": "SetGravityBrick",
    "76": "SetObjectColorBrick",
    "77": "Set3dFrictionBrick",
    "78": "SayForBubbleBrick",
    "79": "ShowTextBrick",
    "80": "BroadcastWaitBrick",
    "81": "AddItemToUserListBrick",
    "82": "OpenUrlBrick",
    "83": "SetXBrick",
    "84": "ShowTextFontBrick",
    "85": "SetSkyColorBrick",
    "86": "ShowText3Brick",
    "87": "ExitStageBrick",
    "88": "SetVolumeToBrick",
    "89": "MoveNStepsBrick",
    "90": "HideText3Brick",
    "91": "ChangeWidthBrick",
    "92": "TurnLeftBrick",
    "93": "SetHeightBrick",
    "94": "StopAllSoundsBrick",
    "95": "SetVelocityBrick",
    "96": "Set3dVelocityBrick",
    "97": "Set3dRotationBrick",
    "98": "ClearGraphicEffectBrick",
    "99": "WriteVariableToFileBrick",
    "100": "CreateSphereBrick",
    "101": "ReadVariableFromFileBrick",
    "102": "CastRayBrick",
    "103": "DeleteWebBrick",
    "104": "SetFogBrick",
    "105": "VibrationBrick",
    "106": "PointToBrick",
    "107": "SetBackgroundByIndexBrick",
    "108": "ChangeBrightnessByNBrick",
    "109": "TurnRightBrick",
    "110": "CreateWebUrlBrick",
    "111": "SetDirectionalLightBrick",
    "112": "Set3dGravityBrick",
    "113": "SetRestitutionBrick",
    "114": "CreateVideoBrick",
    "115": "PreviousLookBrick",
    "116": "CreateWebFileBrick",
    "117": "LookRequestBrick",
    "118": "ChangeHeightBrick",
    "119": "SetCameraFocusPointBrick",
    "120": "Remove3dObjectBrick",
    "121": "CreateTextFieldBrick",
    "122": "ReadListFromDeviceBrick",
    "123": "SetSoundVolumeBrick",
    "124": "SetPenColorBrick",
    "125": "WebRequestBrick",
    "126": "ChooseFileBrick",
    "127": "SplitBrick",
    "128": "FadeParticleEffectBrick",
    "129": "ForVariableFromToBrick",
    "130": "ChooseCameraBrick",
    "131": "SayBubbleBrick",
    "132": "SetMassBrick",
    "133": "CameraBrick",
    "134": "ReadFromFilesBrick",
    "135": "SetAmbientLightBrick",
    "136": "ClearUserListBrick",
    "137": "FlashBrick",
    "138": "DeleteItemOfUserListBrick",
    "139": "SetParticleColorBrick",
    "140": "SetColorBrick",
    "141": "ReplaceItemInUserListBrick",
    "142": "EvalWebBrick",
    "143": "CameraLookAtBrick",
    "144": "StoreCSVIntoUserListBrick",
    "145": "ObjectLookAtBrick",
    "146": "CopyTextBrick",
    "147": "WriteToFilesBrick",
    "148": "SetThirdPersonCameraBrick",
    "149": "WriteListOnDeviceBrick",
    "150": "SetCameraPosition2Brick",
    "151": "SetCCDBrick",
    "152": "CreateTableBrick",
    "153": "CreateDialogBrick",
    "154": "ShowDialogBrick",
    "155": "SpeakBrick",
    "156": "SetPositiveBrick",
    "157": "DeleteFilesBrick",
    "158": "EnablePbrRenderBrick",
    "159": "MoveFilesBrick",
    "160": "AsyncRepeatBrick",
    "161": "StringToTableBrick",
    "162": "PlayDrumForBeatsBrick",
    "163": "IfOnEdgeBounceBrick",
    "164": "TurnLeftSpeedBrick",
    "165": "SetCameraPositionBrick",
    "166": "LoadFromInternalStorageBrick",
    "167": "ChangeColorByNBrick",
    "168": "PaintNewLookBrick",
    "169": "PlaySoundAtBrick",
    "170": "ApplyImpulseBrick",
    "171": "PlayAnimationBrick",
    "172": "SetWebBrick",
    "173": "ParticleEffectAdditivityBrick",
    "174": "AddRadioBrick",
    "175": "SetPenSizeBrick",
    "176": "TurnRightSpeedBrick",
    "177": "PinToCameraBrick",
    "178": "SetCallbackBrick",
    "179": "ThinkForBubbleBrick",
    "180": "PenUpBrick",
    "181": "LaunchProjectBrick",
    "182": "RunJSBrick",
    "183": "SetCameraZoomBrick",
    "184": "OrientationBrick",
    "185": "PenDownBrick",
    "186": "LoadSceneAdditiveBrick",
    "187": "SetHitboxBrick",
    "188": "SetCameraRangeBrick",
    "189": "SetNegativeBrick",
    "190": "PauseVideoBrick",
    "191": "AskSpeechBrick",
    "192": "CreateVarBrick",
    "193": "SoundFilesBrick",
    "194": "RunLuaBrick",
    "195": "AskGPTBrick",
    "196": "ResetTimerBrick",
    "197": "ExportProjectFileBrick",
    "198": "SaveToInternalStorageBrick",
    "199": "LoadSceneBrick",
    "200": "AskGemini2Brick",
    "201": "AskGeminiBrick",
    "202": "SetShaderCodeBrick",
    "203": "SetInstrumentBrick",
    "204": "SetLookFilesBrick",
    "205": "DeleteAllTablesBrick",
    "206": "ClearBackgroundBrick",
    "207": "SetCameraRotation2Brick",
    "208": "PlayVideoBrick",
    "209": "SetGeminiKeyBrick",
    "210": "PostWebRequestBrick",
    "211": "IntervalRepeatBrick",
    "212": "RunPythonScriptBrick",
    "213": "KeyEventBrick",
    "214": "LookFromTableBrick",
    "215": "SpeakAndWaitBrick",
    "216": "SetViewPositionBrick",
    "217": "CutLookBrick",
    "218": "SetBackgroundAndWaitBrick",
    "219": "ChangeVolumeByNBrick",
    "220": "RunVMBrick",
    "221": "PlayNoteForBeatsBrick",
    "222": "SetSkyboxBrick",
    "223": "AddEditBrick",
    "224": "BackgroundRequestBrick",
    "225": "ToggleDisplayBrick",
    "226": "TapForBrick",
    "227": "InsertTableBrick",
    "228": "CreateParticlesBrick",
    "229": "DividePolandBrick",
    "230": "StartRecordingBrick",
    "231": "StopRecordingBrick",
    "232": "DeleteBaseBrick",
    "233": "SendServerBrick",
    "234": "StampBrick",
    "235": "StopRunningStitchBrick",
    "236": "PutFloatBrick",
    "237": "HideStatusBarBrick",
    "238": "LunoScriptBrick",
    "239": "ConnectServerBrick",
    "240": "ThreedCreateCylinderBrick",
    "241": "ThreedAttachObjectToBoneBrick",
    "242": "SetMaterialBrick",
    "243": "SetParentBrick",
    "244": "PrepareMusicAs3DSoundBrick",
    "245": "PlaySoundAtPositionBrick",
    "246": "OpenFileBrick",
    "247": "SetTempoBrick",
    "248": "DeleteLookBrick",
    "249": "InsertItemIntoUserListBrick",
    "250": "MouseEventBrick",
    "251": "UnpinFromCameraBrick",
    "252": "DeleteVarBrick",
    "253": "SeekVideoBrick",
    "254": "LegoNxtMotorStopBrick",
    "255": "PrepareSoundBrick2",
    "256": "StitchBrick",
    "257": "SetThreadColorBrick",
    "258": "RunningStitchBrick",
    "259": "TripleStitchBrick",
    "260": "SewUpBrick",
    "261": "WriteEmbroideryToFileBrick",
    "262": "CreateFloatBrick",
    "263": "TableToFloatBrick",
    "264": "LoadNNBrick",
    "265": "ListenMicroBrick",
    "266": "LoadNativeModuleBrick",
    "267": "CreateDistanceJointBrick",
    "268": "EditLookBrick",
    "269": "SetBackgroundLightBrick",
    "270": "SetFreeCameraBrick",
    "271": "SetRotationLockBrick",
    "272": "ZigZagStitchBrick",
    "273": "CreateDiskBrick",
    "274": "StopVMBrick",
    "275": "StartServerBrick",
    "276": "ZipBrick",
    "277": "ResizeImgBrick",
    "278": "StartListeningBrick",
    "279": "PerformRayCastBrick",
    "280": "FileUrlBrick",
    "281": "SoundFileBrick"
  },
  "vocab_size": 282,
  "structural_tokens": [
    "<project_start>",
    "<project_end>",
    "<scene_start>",
    "<scene_end>",
    "<object_start>",
    "<object_end>",
    "<script_start>",
    "<script_end>",
    "<global_var>",
    "<global_list>",
    "<broadcast>",
    "<signal>"
  ]
}