{
  "word2id": {
    "[PAD]": 0,
    "[UNK]": 1,
    "[SEP]": 2,
    "[START]": 3,
    "[END]": 4,
    "SetYBrick": 5,
    "SetSizeToBrick": 6,
    "ForeverBrick": 7,
    "OpenUrlBrick": 8,
    "SceneStartBrick": 9,
    "ShowToastBlock": 10,
    "ChooseFileBrick": 11,
    "WaitBrick": 12,
    "IfThenLogicBeginBrick": 13,
    "DeleteFilesBrick": 14,
    "SetVariableBrick": 15,
    "DeleteWebBrick": 16,
    "PlaceAtBrick": 17,
    "PointInDirectionBrick": 18,
    "IfLogicBeginBrick": 19,
    "RepeatUntilBrick": 20,
    "HideBrick": 21,
    "AskBrick": 22,
    "SetColorBrick": 23,
    "CreateTextFieldBrick": 24,
    "WriteToFilesBrick": 25,
    "MoveFilesBrick": 26,
    "LaunchProjectBrick": 27,
    "CloneBrick": 28,
    "SetLookBrick": 29,
    "ChangeVariableBrick": 30,
    "ShowBrick": 31,
    "BroadcastBrick": 32,
    "CreateSphereBrick": 33,
    "ShowTextColorSizeAlignmentBrick": 34,
    "SetDirectionalLightBrick": 35,
    "SetObjectColorBrick": 36,
    "Set3dPositionBrick": 37,
    "ReadVariableFromDeviceBrick": 38,
    "SetTransparencyBrick": 39,
    "SetBrightnessBrick": 40,
    "WriteVariableOnDeviceBrick": 41,
    "WaitUntilBrick": 42,
    "BroadcastWaitBrick": 43,
    "StopScriptBrick": 44,
    "ComeToFrontBrick": 45,
    "PlaySoundBrick": 46,
    "StopSoundBrick": 47,
    "HideTextBrick": 48,
    "SayForBubbleBrick": 49,
    "DeleteThisCloneBrick": 50,
    "GoNStepsBackBrick": 51,
    "ClearUserListBrick": 52,
    "AddItemToUserListBrick": 53,
    "UserDefinedBrick": 54,
    "RepeatBrick": 55,
    "SetBackgroundBrick": 56,
    "GoToBrick": 57,
    "SetVolumeToBrick": 58,
    "SetLookByIndexBrick": 59,
    "PointToBrick": 60,
    "SetHeightBrick": 61,
    "VibrationBrick": 62,
    "SetBackgroundByIndexBrick": 63,
    "SetCameraPosition2Brick": 64,
    "SetRotationStyleBrick": 65,
    "PlaySoundAndWaitBrick": 66,
    "SetWidthBrick": 67,
    "ChangeWidthBrick": 68,
    "GlideToBrick": 69,
    "NextLookBrick": 70,
    "StopAllSoundsBrick": 71,
    "SceneTransitionBrick": 72,
    "SetPenSizeBrick": 73,
    "SetPenColorBrick": 74,
    "CameraBrick": 75,
    "ChooseCameraBrick": 76,
    "SetGravityBrick": 77,
    "SetPhysicsObjectTypeBrick": 78,
    "SetBounceBrick": 79,
    "SetVelocityBrick": 80,
    "ExitStageBrick": 81,
    "TurnLeftBrick": 82,
    "SetFogBrick": 83,
    "SetShaderCodeBrick": 84,
    "Set3dGravityBrick": 85,
    "SetSkyColorBrick": 86,
    "SetAmbientLightBrick": 87,
    "SetCameraRangeBrick": 88,
    "SetPhysicsStateBrick": 89,
    "Set3dFrictionBrick": 90,
    "SetRestitutionBrick": 91,
    "Set3dScaleBrick": 92,
    "SetCCDBrick": 93,
    "SetXBrick": 94,
    "CastRayBrick": 95,
    "ChangeYByNBrick": 96,
    "ChangeXByNBrick": 97,
    "ReadVariableFromFileBrick": 98,
    "ReadBaseBrick": 99,
    "WriteBaseBrick": 100,
    "SplitBrick": 101,
    "ShowTextBrick": 102,
    "ShowText3Brick": 103,
    "PreviousLookBrick": 104,
    "SetSoundVolumeBrick": 105,
    "HideText3Brick": 106,
    "SetCameraFocusPointBrick": 107,
    "MoveNStepsBrick": 108,
    "ChangeTransparencyByNBrick": 109,
    "Set3dVelocityBrick": 110,
    "Create3dObjectBrick": 111,
    "CameraLookAtBrick": 112,
    "Set3dRotationBrick": 113,
    "WriteVariableToFileBrick": 114,
    "CopyTextBrick": 115,
    "NoteBrick": 116,
    "ShowTextFontBrick": 117,
    "ChangeBrightnessByNBrick": 118,
    "ChangeSizeByNBrick": 119,
    "CreateWebUrlBrick": 120,
    "SetParticleColorBrick": 121,
    "ParticleEffectAdditivityBrick": 122,
    "FadeParticleEffectBrick": 123,
    "ReadListFromDeviceBrick": 124,
    "DeleteItemOfUserListBrick": 125,
    "TurnRightSpeedBrick": 126,
    "CreateDialogBrick": 127,
    "SetPositiveBrick": 128,
    "SetNegativeBrick": 129,
    "ShowDialogBrick": 130,
    "SetCallbackBrick": 131,
    "CreateWebFileBrick": 132,
    "SetWebBrick": 133,
    "WriteListOnDeviceBrick": 134,
    "AsyncRepeatBrick": 135,
    "BigAskBrick": 136,
    "ChangeHeightBrick": 137,
    "TurnRightBrick": 138,
    "PostWebRequestBrick": 139,
    "ForVariableFromToBrick": 140,
    "LookRequestBrick": 141,
    "AskGemini2Brick": 142,
    "CreateVideoBrick": 143,
    "SetViewPositionBrick": 144,
    "SetFrictionBrick": 145,
    "PinToCameraBrick": 146,
    "UnpinFromCameraBrick": 147,
    "ObjectLookAtBrick": 148,
    "WaitTillIdleBrick": 149,
    "ClearGraphicEffectBrick": 150,
    "PaintNewLookBrick": 151,
    "AskSpeechBrick": 152,
    "PenDownBrick": 153,
    "PenUpBrick": 154,
    "ClearBackgroundBrick": 155,
    "FileUrlBrick": 156,
    "SoundFileBrick": 157,
    "WebRequestBrick": 158,
    "SayBubbleBrick": 159,
    "IfOnEdgeBounceBrick": 160,
    "LoadFromInternalStorageBrick": 161,
    "ReadFromFilesBrick": 162,
    "AskGPTBrick": 163,
    "SaveToInternalStorageBrick": 164,
    "ThinkForBubbleBrick": 165,
    "OrientationBrick": 166,
    "ResetTimerBrick": 167,
    "Remove3dObjectBrick": 168
  },
  "id2word": {
    "0": "[PAD]",
    "1": "[UNK]",
    "2": "[SEP]",
    "3": "[START]",
    "4": "[END]",
    "5": "SetYBrick",
    "6": "SetSizeToBrick",
    "7": "ForeverBrick",
    "8": "OpenUrlBrick",
    "9": "SceneStartBrick",
    "10": "ShowToastBlock",
    "11": "ChooseFileBrick",
    "12": "WaitBrick",
    "13": "IfThenLogicBeginBrick",
    "14": "DeleteFilesBrick",
    "15": "SetVariableBrick",
    "16": "DeleteWebBrick",
    "17": "PlaceAtBrick",
    "18": "PointInDirectionBrick",
    "19": "IfLogicBeginBrick",
    "20": "RepeatUntilBrick",
    "21": "HideBrick",
    "22": "AskBrick",
    "23": "SetColorBrick",
    "24": "CreateTextFieldBrick",
    "25": "WriteToFilesBrick",
    "26": "MoveFilesBrick",
    "27": "LaunchProjectBrick",
    "28": "CloneBrick",
    "29": "SetLookBrick",
    "30": "ChangeVariableBrick",
    "31": "ShowBrick",
    "32": "BroadcastBrick",
    "33": "CreateSphereBrick",
    "34": "ShowTextColorSizeAlignmentBrick",
    "35": "SetDirectionalLightBrick",
    "36": "SetObjectColorBrick",
    "37": "Set3dPositionBrick",
    "38": "ReadVariableFromDeviceBrick",
    "39": "SetTransparencyBrick",
    "40": "SetBrightnessBrick",
    "41": "WriteVariableOnDeviceBrick",
    "42": "WaitUntilBrick",
    "43": "BroadcastWaitBrick",
    "44": "StopScriptBrick",
    "45": "ComeToFrontBrick",
    "46": "PlaySoundBrick",
    "47": "StopSoundBrick",
    "48": "HideTextBrick",
    "49": "SayForBubbleBrick",
    "50": "DeleteThisCloneBrick",
    "51": "GoNStepsBackBrick",
    "52": "ClearUserListBrick",
    "53": "AddItemToUserListBrick",
    "54": "UserDefinedBrick",
    "55": "RepeatBrick",
    "56": "SetBackgroundBrick",
    "57": "GoToBrick",
    "58": "SetVolumeToBrick",
    "59": "SetLookByIndexBrick",
    "60": "PointToBrick",
    "61": "SetHeightBrick",
    "62": "VibrationBrick",
    "63": "SetBackgroundByIndexBrick",
    "64": "SetCameraPosition2Brick",
    "65": "SetRotationStyleBrick",
    "66": "PlaySoundAndWaitBrick",
    "67": "SetWidthBrick",
    "68": "ChangeWidthBrick",
    "69": "GlideToBrick",
    "70": "NextLookBrick",
    "71": "StopAllSoundsBrick",
    "72": "SceneTransitionBrick",
    "73": "SetPenSizeBrick",
    "74": "SetPenColorBrick",
    "75": "CameraBrick",
    "76": "ChooseCameraBrick",
    "77": "SetGravityBrick",
    "78": "SetPhysicsObjectTypeBrick",
    "79": "SetBounceBrick",
    "80": "SetVelocityBrick",
    "81": "ExitStageBrick",
    "82": "TurnLeftBrick",
    "83": "SetFogBrick",
    "84": "SetShaderCodeBrick",
    "85": "Set3dGravityBrick",
    "86": "SetSkyColorBrick",
    "87": "SetAmbientLightBrick",
    "88": "SetCameraRangeBrick",
    "89": "SetPhysicsStateBrick",
    "90": "Set3dFrictionBrick",
    "91": "SetRestitutionBrick",
    "92": "Set3dScaleBrick",
    "93": "SetCCDBrick",
    "94": "SetXBrick",
    "95": "CastRayBrick",
    "96": "ChangeYByNBrick",
    "97": "ChangeXByNBrick",
    "98": "ReadVariableFromFileBrick",
    "99": "ReadBaseBrick",
    "100": "WriteBaseBrick",
    "101": "SplitBrick",
    "102": "ShowTextBrick",
    "103": "ShowText3Brick",
    "104": "PreviousLookBrick",
    "105": "SetSoundVolumeBrick",
    "106": "HideText3Brick",
    "107": "SetCameraFocusPointBrick",
    "108": "MoveNStepsBrick",
    "109": "ChangeTransparencyByNBrick",
    "110": "Set3dVelocityBrick",
    "111": "Create3dObjectBrick",
    "112": "CameraLookAtBrick",
    "113": "Set3dRotationBrick",
    "114": "WriteVariableToFileBrick",
    "115": "CopyTextBrick",
    "116": "NoteBrick",
    "117": "ShowTextFontBrick",
    "118": "ChangeBrightnessByNBrick",
    "119": "ChangeSizeByNBrick",
    "120": "CreateWebUrlBrick",
    "121": "SetParticleColorBrick",
    "122": "ParticleEffectAdditivityBrick",
    "123": "FadeParticleEffectBrick",
    "124": "ReadListFromDeviceBrick",
    "125": "DeleteItemOfUserListBrick",
    "126": "TurnRightSpeedBrick",
    "127": "CreateDialogBrick",
    "128": "SetPositiveBrick",
    "129": "SetNegativeBrick",
    "130": "ShowDialogBrick",
    "131": "SetCallbackBrick",
    "132": "CreateWebFileBrick",
    "133": "SetWebBrick",
    "134": "WriteListOnDeviceBrick",
    "135": "AsyncRepeatBrick",
    "136": "BigAskBrick",
    "137": "ChangeHeightBrick",
    "138": "TurnRightBrick",
    "139": "PostWebRequestBrick",
    "140": "ForVariableFromToBrick",
    "141": "LookRequestBrick",
    "142": "AskGemini2Brick",
    "143": "CreateVideoBrick",
    "144": "SetViewPositionBrick",
    "145": "SetFrictionBrick",
    "146": "PinToCameraBrick",
    "147": "UnpinFromCameraBrick",
    "148": "ObjectLookAtBrick",
    "149": "WaitTillIdleBrick",
    "150": "ClearGraphicEffectBrick",
    "151": "PaintNewLookBrick",
    "152": "AskSpeechBrick",
    "153": "PenDownBrick",
    "154": "PenUpBrick",
    "155": "ClearBackgroundBrick",
    "156": "FileUrlBrick",
    "157": "SoundFileBrick",
    "158": "WebRequestBrick",
    "159": "SayBubbleBrick",
    "160": "IfOnEdgeBounceBrick",
    "161": "LoadFromInternalStorageBrick",
    "162": "ReadFromFilesBrick",
    "163": "AskGPTBrick",
    "164": "SaveToInternalStorageBrick",
    "165": "ThinkForBubbleBrick",
    "166": "OrientationBrick",
    "167": "ResetTimerBrick",
    "168": "Remove3dObjectBrick"
  },
  "vocab_size": 169
}